{
    "title": "My month without a smartphone",
   "date": "2015-08-29 12:00:00 +0000",
    "categories": ["Misc"],
    "paragraphs": [
        "In today’s technological age and an Internet of Things meaning that even our fridges can connect to Twitter, it’s quite rare and even rather difficult to escape the clutches of technology.",
        "Social media sites and applications such as Facebook, Twitter, Instagram, Tinder etc. are a quintessential part of 21st adulthood. Most major events in our lives will be more than likely posted on Facebook, be it a holiday, engagement, a new child etc. For instance, there were people who learned of my Mum’s passing in April via Facebook as opposed to a formal Death Notice. I learned my baby cousin’s name on Facebook as opposed to directly from my own family. A few of us posted a fake status on my girlfriend’s Facebook account a few months ago and we still get questioned and/or congratulated on our supposed engagement.",
        "The use of these applications has become just another part of my day. I get on the bus to work listening to Spotify, check the latest news on Twitter or LinkedIn and catch up on my emails. When I head to lunch, if it’s somewhere nice at least one person checks in via Foursquare, Facebook etc. or Instagrams a photo of their meal. If some more of us head for some drinks after work, you can be guaranteed that there’ll be times where pretty much everyone is fixated on their phone rather than the conversation.",
        "Up until a few months ago, I probably would have never paid much heed to any of this, as I like to think of myself as quite the techie.. I’ve been through most the major phone OSs, I’ve had Linux, Windows and OS X computers. I’ve had tablets, kindles etc. If you can name it, I’ve more than likely at least considered buying it.",
        "But then I went to the US in July, where I rather foolishly knocked my smartphone into a sink. If you’ve ever had the experience of water-logging a phone, the fear and upset I experienced will resonate quite strongly with you. My life was in that phone. I used it as a camera, address book, food and exercise diary, file store, online shopping.. my means of socialising with my peers and many other activities. As I wasn’t working at the time, I was stuck with using a “Blokia” (Old school Nokia) for the weeks after my holidays.",
        "I started work a few weeks later, and received more than a few funny looks when I said I couldn’t connect on Whatsapp. I honestly don’t even think the phone had WAP (but it did have a built-in flashlight). This would leave me at somewhat of a disconnect with my peers when it came to chatting remotely, organising social events etc.",
        "The longer I spent with this cursed Blokia, the more startling our society’s dependence on smartphones became. It may seem to be an odd realisation, but even if it wasn’t a very techie phone, I felt free with it. The appeal of Instagramming my dinner, checking into the cinema on Facebook etc. was weaker than before. On the flipside, peers using their smartphones to deflect from human interaction became an increasing bugbear.",
        "Since this time, however, I’ve gotten another smartphone and am back on the Windows Phone bandwagon. Though I’m back instagramming, tweeting and facebooking my way through my days, I’ve learned from my time sitting on the edge of the smartphone circle.",
        "Overall I feel I’ve gained a better sense of self-awareness when it comes to social media and not over-doing the smartphone. I’ve noticed an obvious shift in my phone usage behaviour. Where before I would not hesitate to whip my phone out at the bar, I now only do so if I’ve a call or a text. When I would’ve spent my morning commute going through my newsfeed, I try to catch a few extra zzzs. Though I may have come back to the loving embrace of my smartphone, I’m managing to better keep it at arm’s length."
    ],
    "closing": "If you’ve any comments/additions/suggestions to this post or any others I’ve written, feel free to comment and/or tweet me @shay_nanigans"
}
