{
"title":  "The Scoop On: Cloud Computing",
"date":   "2015-09-12 12:00:00 +0000",
"categories": [ "Misc" ],
"paragraphs": [
"In this post I'll be discussing the topic of Cloud Computing, giving a brief overview and then discussing some advantages and disadvantages along with bit cloud security. I hope you've enjoyed my posts so far and if you're new, then welcome on-board!",
"Cloud Computing is rather a new business model than a new technology. The phrase is used to refer to the applications and services which work in a distributed environment, use virtualised resources and are available through internet protocols and standard networks. This model is characterised by virtual and unlimited resources, where details concerning physical system, applications are running in, are hidden from the end-user introducing a certain level of abstraction. From the end-user's perspective, one can imagine cloud as a global network with unlimited, always-on and scalable resources.",
"Those in the know when it comes to IT might be a little more than curious as to why implementing Cloud Computing is so successful in today’s market, especially when you consider the underlying technology isn’t anything new. These technologies such as virtualisation, VPN etc. were created long before the dawn of Cloud Computing.",

"For those not quite so well-read on the topic, Cloud Computing is basically how we transfer resources (infrastructure, applications and data) from one place to another. It doesn’t matter whether you transfer data, a whole application, device or virtual machine, the cloud lets you store and distribute resources according to your needs.",
"The word “cloud” refers to two basic ideas:",
"Abstraction – Cloud Computing hides the system's implementation details from the end-user. Applications run on physical systems that aren’t specified, information is stored in an unknown location, systems management is delegated to others, and access to resources is granted to the end-user;",
"Virtualisation – Cloud Computing virtualises systems by storing and distributing resources. IT resources are scaled and delivered according to the needs of a centralised infrastructure and the cost is charged according to level of consumption.",

"Challenges  within Cloud  Computing",

"Accounting – In private systems, the cost of operation is constant whereas with Cloud Computing you operate on a pay-as-you-go model so the costs are calculated individually.",
"Law – The applicable law depends on the geographic location, so suppliers must adjust their policies depending on the region. This is an issue getting increasing publicity these days in relation to the EU-US SafeHarbor agreement. A key concern with this is companies' may operate in one country/continent but their cloud provider's storage may be based in another, so the big questions to be fully hashed out as to which country's law applies when.",
"Data Privacy – To ensure privacy in the cloud additional security systems must be implemented, such as private encryption, VLAN (Virtual Area Network), firewalls; also the local storage for sensitive data is sometimes required.",
"It's important to note that your data is only as safe as the building where the server is stored. You may need to research your provider and ensure they have a strong human-firewall in the facility where your data will be stored. What good is it having invested in security within your own organisation if your cloud provider's protocols aren't up to the same standard and data breaches occur as a result.",
"Monitoring – In private systems each solution requested by the client can be implemented. Cloud mechanisms are often limited to those provided by the supplier which can cause serious restrictions on which provider your organisation can choose depending on business needs.",
"Bottlenecks” – occur when a large number of data must be sent, e.g. an implementation of a system or database replication. Internal LAN copes with this type of tasks much better than their counterparts in the cloud (WAN). Also the performance of storage space, although scalable, may deviate from standard carriers, and obviously high-performance solutions are more expensive.",
"Service Level Agreement (SLA) – Standardized to adapt to majority of end-users, that is why any attempt of negotiating the conditions becomes problematic for small businesses. Before moving to the cloud, its worth analysing the risk, which wasn’t covered by the SLA supplier.",
"Software – Cloud in general forces the use of standardised solutions and reduces the possibility of modifying the existing system. For companies requiring a more bespoke service, you will either pay significantly more for your service or struggle to find suitable cloud options open to you.",
"Aside: SLA is an agreement (using not a contract i.e. not always legally binding) on the performance, negotiated between the client and the provider of the cloud. At the moment, the agreements are generalized in a significant number of cases to meet the needs of majority of clients.",

"Advantages and Disadvantages of Cloud Computing",
"Advantages",
"High power scalability in the cloud introduces the ability to make parallel calculations on a large number of computers. If a company has to perform a complex data analysis, which can take a month, by activating, e.g. one hundred machines in the cloud, they can do the same calculations in a several hours.",
"Novice entrepreneurs often face financial barriers. They don’t have sufficient funds to purchase a license for the software, create a professional storage and data processing centre, or to employ a team of experienced specialists with high qualifications. Processing in the cloud eliminates all the above mentioned barriers. Due to Cloud Computing, both small and large companies are able to access the same IT services.",
"One of the main values introduced by Cloud Computing is the ability to convert fixed expenses on consumables through flexible charging scheme that is tailored to your needs. Replacing the physical infrastructure with a virtual one protects against having too small or too big infrastructure. The development of the company can be hindered, if revenue doesn’t cover the expenses.",
"The company that wants to develop, would have a choice: buy new equipment and implement it on the site, hire equipment at a time, or move all activities to an external provider, whose task would be to provide services. If the demand for services is variable, then the question, how large infrastructure is needed to meet the demand, arises.",
"If the company invests too much in comparison to the number of potential customers – and this number is always difficult to predict – costs will automatically increase. Consequently, customers will leave as they will benefit from cheaper competition’s services.",
"On the other hand, if a company doesn’t invest enough, they won’t be able to take advantage of a sudden, short-term increase in demand, because with the poor quality of hardware the services quality will decrease, and customers leave",
"Another advantage is billing according to consumption. At a time the demand for services is high, a company is able to pay for the provision of increased services. In the opposite case, when the company records a decline in demand for services, doesn’t have to pay the fees for services, which aren’t needed at that moment. The risk of doing business decreases, because the financial side becomes more predictable.",
"Disadvantages",

"The number of problems associated with the use of Cloud Computing is as great as the number of advantages. In general, the idea of public cloud works well for small and medium-sized enterprises. Larger companies can afford high-end hardware and IT staff. Their goal is to use specialized solutions designed specifically for their needs. Using some applications in the cloud, you choose solution that doesn’t need to be specially adopted. In that case preconfigured solutions are the only thing you will be forced to work with. Locally managed versions have far more opportunities of cloud modification than their counterparts.",
"The biggest problem of Cloud Computing concerns security and confidentiality. If data travel through a part of the infrastructure that isn’t under the direct supervision, there is always a risk of intercepting and interfering information. Also, you can’t count on privacy if the government of your provider requests information that are on the same server as the end-user’s data. Its also worth mentioning that when the application is distributed across the globe, its owner should get familiar with the legal issues of the region with regard to the storage of personal data, as regulatory agencies shift all responsibility onto the client.",
"Security in the Cloud",
"Cloud includes features that we already know make it valuable. but unfortunately many of them are associated with a myriad of security problems. A distributed system is more vulnerable to attack than the one held on a local network. Basically Cloud Computing has all the security weak-spots associated with Web applications.",
"Protection of data sent to and from the cloud (and the data sitting there) is a huge consideration when dealing with information security. Similarly to communication within WAN, its necessary to understand that data can be intercepted and modified and be proactive in preventing this by ensuring that any exchange of information is only carried out on an encrypted connection. It also applies to data stored in the cloud. The encrypted data concern not only passwords but also the whole communication as there may be sensitive information. However, this still will not prevent data loss, including private keys, passwords etc.",
"The problem with the data stored in the cloud also applies to the fact that we don’t always know where in the world our data is being stored – in fact, they may be stored anywhere in the supplier’s system. Your data is only as safe as the weakest link in your supplier's own security chain. If the building where they store their servers isn't well secured, then you are open to a security breach and a potential loss/interception of data."],
"closing":"If you’ve any comments/additions/suggestions to this post or any others I’ve written, feel free to comment and/or tweet me @shay_nanigans" }