{
    "title": "Why can’t Facebook and Twitter just obliterate ISIS’s online presence?",
   "date": "2015-11-24 12:00:00 +0000",
    "categories": ["Misc"],
    "paragraphs": [
        "Cyberspace is being used quite effectively by ISIS and other terrorist organisations to radicalise and orchestrate attacks. These groups have proven themselves quite adept at leveraging social media to broadcast propaganda, promote their gruesome “successes”, and instigate fear. It is natural to assume that online services such as Facebook, Twitter and YouTube would ruthlessly and uncompromisingly remove this content and bar those posting it.",
        "To the lay-person this course of action may seem obvious, but the governance of social media is not a straight-forward matter, and online platforms have struggled with the issue in some ways since the days of Al Qaeda affiliates uploading content to YouTube.",
        "The key issue lies in the global nature of social media, the reliance upon self-policing by users to identify and report questionable and objectionable content, and the fact that many of those banned simply open another account and continue posting their hatred.",
        "A collective known as Anonymous, have however, taken matters into their own hands (or onto their own keyboards, if you will). The international hacking group claims to have taken down over 20,000 ISIS-linked Twitter accounts through their #OpParis operation in revenge for the deadly attacks on November 13th. The group are using code, rather than high-powered weapons, in attempts to eliminate ISIS’s online presence.", 
        "The approach taken by the hacktivist group may be broadly encouraged, but such aggressive tactics may not be suitable for use by social media platforms. A blanket policy of banning anything that might be seen as inciting violence also could lead to questions of censorship; one person’s hateful propaganda could be another’s free speech. That is not to say that companies such as Facebook and Twitter aren’t taking the matter seriously and trying to draw a distinction between the two. But this task is nowhere near as simple as you would assume.",
        "According to Facebook, any profile, page or group related to a terrorist organisation is shut down and any content celebrating terrorism is removed. This approach seems to broadly work. Facebook has deleted posts and blocked accounts in such a way that ISIS-related newsletters, video, and photos don’t seem to crop as much as other sites on the web. There is the issue however, that not all content is judged fairly. For example, there was a case of a girl called Isis who had her Facebook profile removed based on her first name, and has had to engage in a lengthy process to have her profile reactivated which involved providing supporting documents such as a passport to prove her identity.",
        "In recent years, the use of Twitter by terrorist organisations, however, has grown. ISIS supporters embraced the platform in the latter part of the last decade. According to research from the Brookings Institute, ISIS supporters used some 46,000 Twitter accounts between September and December 2014, though not all were simultaneously active. Until late last year, Twitter had for the most part adopted a more detached stance on ISIS-related content. Following the emergence of videos and pictures of James Foley’s beheading spreading on social media, Twitter were forced to take a more aggressive approach.",
        "But the question remains, is suspending these Twitter accounts alone enough to curb the spread of ISIS’s propaganda and recruiting online? The answer, in my humble opinion is no, as currently there are no measures implemented to stop these users from setting up a new account when their profile is suspended or removed. The situation is rather Hydra-like, in that cutting the head causes more to grow, making the issue worse rather than taking more serious steps and implementing the proper technology to get to the heart of the problem and permanently remove these users from these online platforms.",
        "There is a new challenge emerging for sites like Facebook and Twitter that goes beyond tracking down content that promotes terrorism. It also requires defining “promoting terrorism”. In a sense, both platforms can be viewed as global communities, each engaged in a constant process of determining ever-changing norms as the community and use of the platform evolves.",
        "Security services need to develop strategies to disrupt the use of these platforms in promoting intolerance and in organising terrorist-oriented activities. There is also the question though, if these service providers start more adequately monitoring and removing this kind of content, where is the line drawn? Do we lose our right to express an opinion based on the use of certain blocked “key-words”? In terms of the artificial intelligence there to monitor this content, can it truly understand postings and their context, in that a reference to Isis could be to the Egyptian God and not the terrorist organisation we have come to associate the label with?",
        "A positive of this potentially increased level of surveillance is that it could be used not just to crack down on terrorism activities, but also on organised crime. The argument proposed by free speech activists is, however, that if governments start actively encouraging the policing of certain kinds of speech, that we will be moving uncomfortably close to censorship."
    ],
    "closing": "If you’ve any comments/additions/suggestions to this post or any others I’ve written, feel free to comment and/or tweet me @shay_nanigans "
}