{
    "title":  "Hacking your life",
    "date":   "2016-03-08 12:00:00 +0000",
    "categories": [ "Misc" ],
    "paragraphs":[
        "We live in an age where the smartphone in our pocket is more powerful than the technology that put man on the moon.",
        "There are an abundance of apps that can assist you in the planning of your days and weeks, from To-Do lists to Meal Planners and activity trackers. These days it really is getting so much simpler to “hack” your life.",
        "I’d been somewhat sceptical of these apps and technologies, up until a few months ago when my fiancée gave me an UP3 activity band for Christmas. Before this I had used the occasional pedometer app such as Pacer, and given various food logging tools a try but nothing had ever stuck because of the effort involved on my part to track my day by manually adding foods and their nutritional composition.. it was all a bit tedious.",
        "But then, the UP came into my life. The band is in my opinion, marvellously simple. You charge it, install the UP app to your smartphone (iPhone in my case), put the band on and away you go. The band automatically syncs with your phone, tracking your sleep and activities, working out your burn for the day and provides your with a suggested calorific intake based on your goals.",
        "In my case, I’m trying to shed more than a few pounds, and have found the band and app nothing short of revolutionary. I use MyFitnessPal to sync my eating habits (as the UP food database is currently lacking), it gives me a score out of 10 my meal (Green = Good, Red = Bad) and I can see in real time based on how active I’ve been if I need to have a snack or if I’m done for the day.. It abstracts the process of counting calories etc. away and lets you get on with your day.",
        "The band and app can also track your sleep, to help you find patterns in you nightly routine to sleep better, and also comes with a noiseless alarm. With this alarm, you set a time you would like to wake up by, and a window before that time that’s acceptable to wake and just go to sleep, it’s that simple. The band then analyses your sleep to find the best time in that window to wake you (i.e. when you’re in a light sleep), and starts vibrating on your wrist until you get up and move about. (Or if you’re a git like me you hold it to your fiancée’s forehead and it wakes them up too.. great!).",
        "As far as emerging wearable technology goes, fitness trackers are very-much blazing the trail. Though the technology isn't exactly perfect, its constantly improving. I feel there is immense opportunity to integrate these devices into our healthcare systems and that the data generated could be leveraged by healthcare professionals to gain a better insight into our lifestyles. This could be by our GP to assess whether, for example, our low-level of activity could be increased to combat diabetes, or what the effects are of long term sleep deprivation on our health. This data could also be used by Health Insurance providers to assess risk, similar to the idea of Driving Apps as seen with some Car Insurance providers such as AXA are currently show-casing.",
        "Here is where there is a great potential for the data analytics sector to link into these key industries to help with sifting, sorting and separating the correlations from causations. Should these key connections made and research undertaken, it could revolutionise the future of our healthcare systems worldwide.",
        "I will admit to being a bit of a gimic addict, whilst also being incredibly cynical of anything both gadget and healthy related. However, I’m just 2 months into using my UP and I’ve genuinely noticed a major change in my eating habits, my energy and sleep and quite importantly.. the fit of my jeans!"],
    "closing":"If you’ve any comments/additions/suggestions to this post or any others I’ve written, feel free to comment and/or tweet me @shay_nanigans "
}