{
"title":  "Computer Science and the Irish Education System",
"date":   "2016-03-30 12:00:00 +0000",
"categories": [ "Misc" ],

"paragraphs":["In our modern society, it is easy to see the influence and impact of the field of computer science on everyday life. Globally we rely heavily on digital systems for everything from driving trains, monitoring our health, giving us our money from the ATM to even our mobile phones.",
"Employers across a myriad of industries are desperately seeking graduates with strong computing and coding skills with many supporting initiatives such as CoderDojo, a network of voluntary clubs, in an attempt to foster up-and-coming talent.",
"For many years, Irish children and teens with an interest in coding have been heavily dependent on CoderDojo to develop their programming skills. The current lack of a computer programming subject is seen as a serious omission from the second-level curriculum by many IT professionals.",
" Following several years of debates and discussions, it has finally been decided to formally introduce Computer Science into the Irish school curriculum at second level. Government education advisers have already commenced exploratory work on the introduction of the subject, which is more and more regarded as a vitally important area of learning for students.",
"Core components of computer science are scheduled to make their way on to the Junior Cert curriculum as early as this September, with a short course in programming set to lead the charge. Although initially only a some schools will be equipped to commence teaching programming, it is hoped that the program will be rapidly rolled out across the country.",
"The proposed Leaving Cert subject would build on this ground-work, providing students with a deeper understanding of how to use computers to analyse and solve problems, with the ultimate aim of providing a solid foundation upon which to pursue further studies in this field at 3rd-level. It will take many years for computer science to become a fully-fledged subject on the Leaving Cert curriculum and this will require massive volumes of research and input from the NCCA (National Council for Curriculum and Assessment).",
"A considerable minority of students are now reliant on learning supports to succeed at 3rd level, such as the Maths Support and Programming Support centres on offer at Maynooth University, where Computer Science would appear to have a lower drop-out rate when compared to other universities at approximately 15%.",
"Considering the complete lack of computing or programming currently within the Irish second-level education system it is worth noting that an Irish student, Catrina Carrigan, was instrumental in the development of a programming course at GCSE level in the UK. Following on from the Coolest Project Awards, Catrina was put in touch with the UK agency eSkills about developing a GCSE coding course for UK teens. Through these conversations, one of Catrina's CoderDojo project formed the basis of the Piano Rock Star game, and is currently used to teach programming skills to UK teenagers.",
"Due to the lack of understanding or preparedness as to what courses in computing entail, the drop-out rates are quite high when compared to subjects also offered at second-level. There is acute concern over non-progression rates in computer science courses, given a severe skills shortage in the information and computer technology (ICT) sector. Approximately 1/3 of computer science students across all institutes of technology are dropping out after first year in college. These rates reached as high as 70% in some individual IT courses in 2014-2015.",
"A considerable minority of students are now reliant on learning supports to succeed at 3rd level, such as the Maths Support and Programming Support centres on offer at Maynooth University, where Computer Science would appear to have a lower drop-out rate when compared to other universities at approximately 15%.",
"Though programming and coding will prove vital skills in the future economy, it will be interesting to see the development of these skills and courses at second-level, how they will be assessed and the impact this has on future school-leavers looking to break into computing."],
  
"closing": "If you’ve any comments/additions/suggestions to this post or any others I’ve written, feel free to comment and/or tweet me @shay_nanigans" }